app/controllers/projects_controller.rb

    def create
        project = Project.create!(user_id: params[:user_id], title: params[:title], description: params[:description], timeframe: params[:timeframe], route: params[:route])
        awardArray = params[:awards].split(", ")
        awardArray.each do |s|
            Award.create(name: s, project_id: project.id)
        end

        languageArray = params[:languages].split(", ")
        languageArray.each do |l|
            lang = nil
            if Language.find_by(name: l)
                lang = Language.find_by(name: l)
            else
                lang = Language.create(name: l)
            end
            ProjectLanguage.create(project_id: project.id, language_id: lang.id)
        end
        render json: User.find(params[:user_id]), include: ['projects', 'projects.awards', 'projects.languages'], status: :created
---
INSERT INTO "projects" ("title", "description", "timeframe", "route", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "as"], ["description", "as"], ["timeframe", "as"], ["route", "as"], ["user_id", 1], ["created_at", "2022-10-24 21:45:56.514486"], ["updated_at", "2022-10-24 21:45:56.514486"]]
SELECT "awards".* FROM "awards" WHERE "awards"."project_id" = ?  [["project_id", 3]]
INSERT INTO "awards" ("name", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cool"], ["project_id", 3], ["created_at", "2022-10-24 21:45:56.520713"], ["updated_at", "2022-10-24 21:45:56.520713"]]
SELECT "languages".* FROM "languages" WHERE "languages"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
INSERT INTO "languages" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2022-10-25 17:01:42.740870"], ["updated_at", "2022-10-25 17:01:42.740870"]]
INSERT INTO "project_languages" ("project_id", "language_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 34], ["language_id", 9], ["created_at", "2022-10-25 16:49:09.342112"], ["updated_at", "2022-10-25 16:49:09.342112"]]
SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        project = Project.find(params[:id])
        project.awards.destroy_all
        project.project_languages.destroy_all
        awardArray = params[:awards].split(", ")
        awardArray.each do |s|
            Award.create(name: s, project_id: project.id)
        end
        languageArray = params[:languages].split(", ")
        languageArray.each do |l|
            lang = nil
            if Language.find_by(name: l)
                lang = Language.find_by(name: l)
            else
                lang = Language.create(name: l)
            end
            ProjectLanguage.create(project_id: project.id, language_id: lang.id)
        end
        project.update!(user_id: params[:user_id], title: params[:title], description: params[:description], timeframe: params[:timeframe], route: params[:route])
        render json: User.find(params[:user_id]), include: ['projects', 'projects.awards', 'projects.languages'], status: :accepted
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "awards" WHERE "awards"."id" = ?  [["id", 4]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
DELETE FROM "project_languages" WHERE "project_languages"."id" = ?  [["id", 1]]
SELECT "awards".* FROM "awards" WHERE "awards"."project_id" = ?  [["project_id", 4]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "174!!!"], ["updated_at", "2022-10-25 16:56:21.955003"], ["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        project = Project.find(params[:id])
        user = User.find(project.user_id)
        project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]