app/controllers/projects_controller.rb

    def create
        project = Project.create!(user_id: params[:user_id], title: params[:title], description: params[:description], timeframe: params[:timeframe], route: params[:route])
        Award.create(name: params[:awards], project_id: project.id)
        lang = nil
        if Language.find_by(name: params[:languages])
            lang = Language.find_by(name: params[:languages])
        else
            lang = Language.create(name: params[:languages])
        end
        ProjectLanguage.create(project_id: project.id, language_id: lang.id)
        render json: User.find(params[:user_id]), status: :created
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        project = Project.find(params[:id])
        project.update!(project_params)
---
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "174!!!"], ["updated_at", "2022-10-25 16:56:21.955003"], ["id", 1]]