app/controllers/users_controller.rb

SELECT "awards".* FROM "awards" WHERE "awards"."project_id" = ?  [["project_id", 1]]
SELECT "languages".* FROM "languages" INNER JOIN "project_languages" ON "languages"."id" = "project_languages"."language_id" WHERE "project_languages"."project_id" = ?  [["project_id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 5]]
SELECT "users".* FROM "users"
---
    def index
        render json: User.all, include: ['projects', 'projects.awards', 'projects.languages']

INSERT INTO "users" ("name", "username", "bio", "img_url", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        user = User.create!(user_params)